---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.Image
source: html/dc2b012e-f453-5859-9fd6-32379dbc542f.htm
---
# Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.Image Property

An external resource type representing images.

## Syntax (C#)
```csharp
public static ExternalResourceType Image { get; }
```